In [1]:
import numpy as np
import pandas as pd
import os
os.chdir('C:\\')

In [3]:
df = pd.read_excel('Date_Data.xlsx')

In [4]:
df.head()

         Date
0  31/04/2019
1  30/04/2019
2  28/02/2019
3  29/02/2019
4  31/09/2019

In [9]:
df['New_Date'] = pd.to_datetime(df['Date'], errors='coerce')

In [10]:
df.head()

         Date   New_Date
0  31/04/2019        NaT
1  30/04/2019 2019-04-30
2  28/02/2019 2019-02-28
3  29/02/2019        NaT
4  31/09/2019        NaT

In [33]:
df_1 = pd.read_excel('Raw_Data.xlsx')

In [34]:
df_1.shape

(10, 5)

In [35]:
df_1[df_1.duplicated(['ID'], keep=False)]

,ID,Enrollment_Date,TRAINER_MANAGING,TRAINER_OPERATOR,FIRST_VISIT_DATE
0,11795,40966,0643D38-Hanover NH,0649597-White River VT,40998.0
1,11795,41093,0649597-White River VT,0643D38-Hanover NH,41079.0
2,8096,40896,0649597-White River VT,0643D38-Hanover NH,41085.0
3,8096,41129,0643D38-Hanover NH,0649597-White River VT,41008.0
4,A036,40877,063B208-Randolph VT,06CB8CF-Hanover NH,41130.0
5,A036,41000,06CB8CF-Hanover NH,063B208-Randolph VT,NaN
6,A036,41132,06D3206-Hanover NH,NaN,41079.0

In [36]:
df_1.isnull().sum()

ID                  0
Enrollment_Date     0
TRAINER_MANAGING    0
TRAINER_OPERATOR    1
FIRST_VISIT_DATE    1
dtype: int64

In [37]:
nans = lambda df_1: df_1[df_1.isnull().any(axis=1)]

In [39]:
nans(df_1)

,ID,Enrollment_Date,TRAINER_MANAGING,TRAINER_OPERATOR,FIRST_VISIT_DATE
5,A036,41000,06CB8CF-Hanover NH,063B208-Randolph VT,NaN
6,A036,41132,06D3206-Hanover NH,NaN,41079.0

In [41]:
df_1[(df_1['ID'].isnull()) | (df_1['Enrollment_Date'].isnull()) | (df_1['TRAINER_MANAGING'].isnull()) | (df_1['TRAINER_OPERATOR'].isnull() | df_1['FIRST_VISIT_DATE'].isnull())]

,ID,Enrollment_Date,TRAINER_MANAGING,TRAINER_OPERATOR,FIRST_VISIT_DATE
5,A036,41000,06CB8CF-Hanover NH,063B208-Randolph VT,NaN
6,A036,41132,06D3206-Hanover NH,NaN,41079.0

In [47]:
df_2 = pd.read_excel('Raw_Data_2.xlsx')

In [48]:
df_2.head(6)

  N-D      num unit
0  Q1    -1.48   UD
1  Q2      1.7   UD
2  Q3    -6.18   UD
3  Q4     0.25   UD
4  Q5   sum(d)   UD
5  Q6  2.03399   UD

In [49]:
print(df_2[pd.to_numeric(df_2['num'], errors='coerce').isnull()])

  N-D     num unit
4  Q5  sum(d)   UD

In [13]:
df_3 = pd.read_excel('Raw_Data_3.xlsx')

In [14]:
df_3.head()

  N-D           num unit
0  Q1 -1.480000e+00   UD
1  Q2  1.700000e+00   UD
2  Q3 -6.180000e+00   UD
3  Q4  2.500000e-01   UD
4  Q5  6.786787e+13   UD

In [21]:
df_4 = pd.read_excel('Date_Data.xlsx')

In [23]:
df_4.head()

         Date
0  31/04/2019
1  30/04/2019
2  28/02/2019
3  29/02/2019
4  31/09/2019

In [28]:
try:
    pd.to_datetime(df_4['Date'], format='%d-%b-%Y', errors='raise')
    # do something
except ValueError:
    pass

In [27]:
df_4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 1 columns):
Date    6 non-null object
dtypes: object(1)
memory usage: 176.0+ bytes

In [29]:
import datetime

In [35]:
inputdate = input("Enter the date in fromat 'dd/mm/yy' :")

Enter the date in fromat 'dd/mm/yy' :31/02/2017

In [36]:
day, month, year = inputdate.split('/')

In [37]:
isValidDate = True
try:
    datetime.datetime(int(year), int(month), int(day))
except ValueError:
    isValidDate = False

In [38]:
if(isValidDate):
    print("Input date is valid ..")
else:
    print("Input date is not valid ..")

Input date is not valid ..